# data input/output

In [13]:
import pandas as pd
ds_dir = "../../data_sets/"

In [6]:
# read from csv
df = pd.read_csv(ds_dir + "example.csv")
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [7]:
# write as csv
df.to_csv(ds_dir + "example_output.csv", index=False)

In [9]:
df = pd.read_csv(ds_dir + "example_output.csv")
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [10]:
!pip install xlrd
!pip install openpyxl
!pip install lxml
!pip install html5lib
!pip install BeautifulSoup4
!pip install sqlalchemy

Requirement already satisfied: xlrd in c:\python\lib\site-packages (2.0.1)

WARNING: You are using pip version 22.0.2; however, version 22.0.4 is available.
You should consider upgrading via the 'c:\python\python.exe -m pip install --upgrade pip' command.

Requirement already satisfied: openpyxl in c:\python\lib\site-packages (3.0.9)
Requirement already satisfied: et-xmlfile in c:\python\lib\site-packages (from openpyxl) (1.1.0)

WARNING: You are using pip version 22.0.2; however, version 22.0.4 is available.
You should consider upgrading via the 'c:\python\python.exe -m pip install --upgrade pip' command.

Requirement already satisfied: lxml in c:\python\lib\site-packages (4.7.1)

WARNING: You are using pip version 22.0.2; however, version 22.0.4 is available.
You should consider upgrading via the 'c:\python\python.exe -m pip install --upgrade pip' command.

Requirement already satisfied: html5lib in c:\python\lib\site-packages (1.1)
Requirement already satisfied: webencodings in c:\python\lib\site-packages (from html5lib) (0.5.1)
Requirement already satisfied: six>=1.9 in c:\python\lib\site-packages (from html5lib) (1.14.0)

WARNING: You are using pip version 22.0.2; however, version 22.0.4 is available.
You should consider upgrading via the 'c:\python\python.exe -m pip install --upgrade pip' command.

Requirement already satisfied: BeautifulSoup4 in c:\python\lib\site-packages (4.10.0)
Requirement already satisfied: soupsieve>1.2 in c:\python\lib\site-packages (from BeautifulSoup4) (2.3.1)

WARNING: You are using pip version 22.0.2; however, version 22.0.4 is available.
You should consider upgrading via the 'c:\python\python.exe -m pip install --upgrade pip' command.

Requirement already satisfied: sqlalchemy in c:\python\lib\site-packages (1.4.31)
Requirement already satisfied: greenlet!=0.4.17 in c:\python\lib\site-packages (from sqlalchemy) (1.1.2)

WARNING: You are using pip version 22.0.2; however, version 22.0.4 is available.
You should consider upgrading via the 'c:\python\python.exe -m pip install --upgrade pip' command.

In [14]:
# read excel
df = pd.read_excel(ds_dir + "Excel_Sample.xlsx")
df.drop(df.columns[0], axis=1, inplace=True)
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [15]:
# write to excel
df.to_excel(ds_dir + "Excel_Sample1.xlsx")

In [16]:
# read html page (returns list of data frames)
data = pd.read_html("https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/")
data[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
...,...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [17]:
# convert df to sql table
from sqlalchemy import create_engine
engine = create_engine('sqlite:///:memory:')
df.to_sql('my_table', engine)

In [18]:
# read sql table
sql_df = pd.read_sql('my_table', con=engine)
sql_df

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15

# pandas dataframes

In [19]:
import pandas as pd
from numpy.random import randn

In [20]:
df = pd.DataFrame(randn(5,4), index=[1,2,3,4,5], columns=["A", 'B', 'C', 'D'])
df

          A         B         C         D
1 -1.027879 -0.383788 -1.070705  0.498878
2  1.361938  0.548580  0.409663  0.887074
3  0.738723 -0.941556 -0.074115  1.132823
4 -1.002277 -0.457034 -1.117474 -1.849072
5 -0.666146 -0.483424 -0.123861  0.575858

In [21]:
df["A"]

1   -1.027879
2    1.361938
3    0.738723
4   -1.002277
5   -0.666146
Name: A, dtype: float64

In [22]:
df[['A', 'C']]

          A         C
1 -1.027879 -1.070705
2  1.361938  0.409663
3  0.738723 -0.074115
4 -1.002277 -1.117474
5 -0.666146 -0.123861

In [23]:
# reset the existing column or create a new one
print(df)
df['A'] = df['A'] + df['B']
print(df)

          A         B         C         D
1 -1.027879 -0.383788 -1.070705  0.498878
2  1.361938  0.548580  0.409663  0.887074
3  0.738723 -0.941556 -0.074115  1.132823
4 -1.002277 -0.457034 -1.117474 -1.849072
5 -0.666146 -0.483424 -0.123861  0.575858
          A         B         C         D
1 -1.411667 -0.383788 -1.070705  0.498878
2  1.910519  0.548580  0.409663  0.887074
3 -0.202833 -0.941556 -0.074115  1.132823
4 -1.459311 -0.457034 -1.117474 -1.849072
5 -1.149570 -0.483424 -0.123861  0.575858

In [24]:
# remove column from existing df (inplace=True)
df.drop('A',axis=1, inplace=True)
df

          B         C         D
1 -0.383788 -1.070705  0.498878
2  0.548580  0.409663  0.887074
3 -0.941556 -0.074115  1.132823
4 -0.457034 -1.117474 -1.849072
5 -0.483424 -0.123861  0.575858

In [25]:
df.drop(5, inplace=True)
df

          B         C         D
1 -0.383788 -1.070705  0.498878
2  0.548580  0.409663  0.887074
3 -0.941556 -0.074115  1.132823
4 -0.457034 -1.117474 -1.849072

In [26]:
# select rows
df.loc[4]

B   -0.457034
C   -1.117474
D   -1.849072
Name: 4, dtype: float64

In [27]:
df.iloc[0]

B   -0.383788
C   -1.070705
D    0.498878
Name: 1, dtype: float64

In [28]:
# select set of rows and columns
df.loc[1, 'B']

-0.383787613456656

In [29]:
df.loc[[1, 2], ['B', 'C']]

          B         C
1 -0.383788 -1.070705
2  0.548580  0.409663

Conditional selection

In [30]:
df > 0

       B      C      D
1  False  False   True
2   True   True   True
3  False  False   True
4  False  False  False

In [31]:
bool_df = df > 0
# mask on original df
df[bool_df]

         B         C         D
1      NaN       NaN  0.498878
2  0.54858  0.409663  0.887074
3      NaN       NaN  1.132823
4      NaN       NaN       NaN

In [32]:
# not satisfying the condition rows are removed
df[df['B'] > 0]

         B         C         D
2  0.54858  0.409663  0.887074

In [33]:
# new data frame
df = pd.DataFrame(randn(5,6), index=[1,2,3,4,5], columns=["A", 'B', 'C', 'D', 'E', 'F'])
df

          A         B         C         D         E         F
1  0.302625  0.188397  2.646485 -0.174067 -0.883278  0.723225
2 -1.361299 -1.650555 -0.452063 -0.431039  0.844351  0.782004
3  0.271422  1.672628 -1.933855 -1.382610  0.534371  0.520941
4  0.417267 -1.233811  0.442234 -1.502121 -1.111552  0.781992
5  0.107003  0.479569 -1.353357  0.412944  0.566674 -0.437847

In [34]:
# multiple conditions
df[(df['A'] > 0) & (df['D'] > 0)]

          A         B         C         D         E         F
5  0.107003  0.479569 -1.353357  0.412944  0.566674 -0.437847

In [35]:
df[(df['A'] > 0) | (df['D'] > 0)]

          A         B         C         D         E         F
1  0.302625  0.188397  2.646485 -0.174067 -0.883278  0.723225
3  0.271422  1.672628 -1.933855 -1.382610  0.534371  0.520941
4  0.417267 -1.233811  0.442234 -1.502121 -1.111552  0.781992
5  0.107003  0.479569 -1.353357  0.412944  0.566674 -0.437847

indexes

In [36]:
# adding default index and set old as a column
df.reset_index()

   index         A         B         C         D         E         F
0      1  0.302625  0.188397  2.646485 -0.174067 -0.883278  0.723225
1      2 -1.361299 -1.650555 -0.452063 -0.431039  0.844351  0.782004
2      3  0.271422  1.672628 -1.933855 -1.382610  0.534371  0.520941
3      4  0.417267 -1.233811  0.442234 -1.502121 -1.111552  0.781992
4      5  0.107003  0.479569 -1.353357  0.412944  0.566674 -0.437847

In [37]:
# avoid adding old indexes as a column
df.reset_index(drop=True)

          A         B         C         D         E         F
0  0.302625  0.188397  2.646485 -0.174067 -0.883278  0.723225
1 -1.361299 -1.650555 -0.452063 -0.431039  0.844351  0.782004
2  0.271422  1.672628 -1.933855 -1.382610  0.534371  0.520941
3  0.417267 -1.233811  0.442234 -1.502121 -1.111552  0.781992
4  0.107003  0.479569 -1.353357  0.412944  0.566674 -0.437847

In [38]:
df["keys"] = ['a', 'b', 'c', 'd', 'e']
df

          A         B         C         D         E         F keys
1  0.302625  0.188397  2.646485 -0.174067 -0.883278  0.723225    a
2 -1.361299 -1.650555 -0.452063 -0.431039  0.844351  0.782004    b
3  0.271422  1.672628 -1.933855 -1.382610  0.534371  0.520941    c
4  0.417267 -1.233811  0.442234 -1.502121 -1.111552  0.781992    d
5  0.107003  0.479569 -1.353357  0.412944  0.566674 -0.437847    e

In [39]:
# set indexes using existing column
df.set_index("keys")

             A         B         C         D         E         F
keys
a     0.302625  0.188397  2.646485 -0.174067 -0.883278  0.723225
b    -1.361299 -1.650555 -0.452063 -0.431039  0.844351  0.782004
c     0.271422  1.672628 -1.933855 -1.382610  0.534371  0.520941
d     0.417267 -1.233811  0.442234 -1.502121 -1.111552  0.781992
e     0.107003  0.479569 -1.353357  0.412944  0.566674 -0.437847

index levels

In [40]:
outer_index = ['A', 'A', 'A', 'B', 'B', 'B']
inner_index = [1,2,3,1,2,3]
hier_index = list(zip(outer_index, inner_index))
hier_index

[('A', 1), ('A', 2), ('A', 3), ('B', 1), ('B', 2), ('B', 3)]

In [41]:
# create multi-index
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('A', 1),
            ('A', 2),
            ('A', 3),
            ('B', 1),
            ('B', 2),
            ('B', 3)],
           )

In [42]:
df = pd.DataFrame(randn(6, 3), hier_index, ['A', "B", "C"])
df

            A         B         C
A 1  1.357409 -0.930236 -0.189879
  2 -0.913503 -0.349168  0.989956
  3  1.071652 -1.844045  0.197562
B 1 -0.834087  1.208637 -0.705106
  2  1.288759 -0.605116 -1.580532
  3  0.391490 -0.559679 -0.142223

In [43]:
# access throw multiple index
df.loc['A'].loc[[1, 2]]

          A         B         C
1  1.357409 -0.930236 -0.189879
2 -0.913503 -0.349168  0.989956

In [44]:
# set index names
df.index.names = ['Group', 'Number']
df

                     A         B         C
Group Number
A     1       1.357409 -0.930236 -0.189879
      2      -0.913503 -0.349168  0.989956
      3       1.071652 -1.844045  0.197562
B     1      -0.834087  1.208637 -0.705106
      2       1.288759 -0.605116 -1.580532
      3       0.391490 -0.559679 -0.142223

In [45]:
# get value
df.loc['B'].loc[2]['C']

-1.5805318598649458

In [46]:
# cross-section
df.xs('A')

               A         B         C
Number
1       1.357409 -0.930236 -0.189879
2      -0.913503 -0.349168  0.989956
3       1.071652 -1.844045  0.197562

In [47]:
# the same with 'loc'
df.loc['A']

               A         B         C
Number
1       1.357409 -0.930236 -0.189879
2      -0.913503 -0.349168  0.989956
3       1.071652 -1.844045  0.197562

In [48]:
# get all '1' from all outer indexes
df.xs(1, level='Number')

              A         B         C
Group
A      1.357409 -0.930236 -0.189879
B     -0.834087  1.208637 -0.705106

# missing data

In [49]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [50]:
# drop nan values
df = pd.DataFrame(randn(5,4), index=[1,2,3,4,5], columns=['A', 'B', 'C', 'D'])
df['A'][3] = np.nan
df['D'][4] = np.nan
df

          A         B         C         D
1  1.842172  0.249051 -1.104209  1.554990
2 -2.017240  1.624390  0.330917  0.323125
3       NaN  0.442887  1.013367 -0.815092
4 -1.028802  0.995333  1.757248       NaN
5 -0.265481 -0.966245  0.988051  0.981440

In [51]:
# drop all rows with nan
df.dropna()

          A         B         C         D
1  1.842172  0.249051 -1.104209  1.554990
2 -2.017240  1.624390  0.330917  0.323125
5 -0.265481 -0.966245  0.988051  0.981440

In [52]:
# drop all columns with nan
df.dropna(axis=1)

          B         C
1  0.249051 -1.104209
2  1.624390  0.330917
3  0.442887  1.013367
4  0.995333  1.757248
5 -0.966245  0.988051

In [53]:
# threshold using
df['D'][1] = np.nan
df

          A         B         C         D
1  1.842172  0.249051 -1.104209       NaN
2 -2.017240  1.624390  0.330917  0.323125
3       NaN  0.442887  1.013367 -0.815092
4 -1.028802  0.995333  1.757248       NaN
5 -0.265481 -0.966245  0.988051  0.981440

In [54]:
df.dropna(axis=1, thresh=4)

          A         B         C
1  1.842172  0.249051 -1.104209
2 -2.017240  1.624390  0.330917
3       NaN  0.442887  1.013367
4 -1.028802  0.995333  1.757248
5 -0.265481 -0.966245  0.988051

In [ ]:
# fill nan values
df.fillna(value=1)

In [55]:
# fill nan by function of items
df['D'].fillna(value=df['D'].mean(), inplace=True)
df

          A         B         C         D
1  1.842172  0.249051 -1.104209  0.163158
2 -2.017240  1.624390  0.330917  0.323125
3       NaN  0.442887  1.013367 -0.815092
4 -1.028802  0.995333  1.757248  0.163158
5 -0.265481 -0.966245  0.988051  0.981440

# group by

In [56]:
import pandas as pd

In [57]:
data = {'Company':['intel', 'intel', 'facebook', 'google', 'google', 'google'],
        'Employers':['Andrey', 'Sergey', 'Pavel', 'Arseniy', 'Alexander', 'Bulat'],
        'Sales':[100, 120, 100, 80, 70, 100]}
df = pd.DataFrame(data)
df

    Company  Employers  Sales
0     intel     Andrey    100
1     intel     Sergey    120
2  facebook      Pavel    100
3    google    Arseniy     80
4    google  Alexander     70
5    google      Bulat    100

In [58]:
# group by company with mean aggregation function on sales
new_df = pd.DataFrame(df.groupby('Company')['Sales'].mean())
new_df

               Sales
Company
facebook  100.000000
google     83.333333
intel     110.000000

In [59]:
# max sale
new_df = pd.DataFrame(df.groupby('Company')['Sales'].max())
new_df

          Sales
Company
facebook    100
google      100
intel       120

In [60]:
# describe grouped data frame
df.groupby('Company').describe().transpose()

Company      facebook      google       intel
Sales count       1.0    3.000000    2.000000
      mean      100.0   83.333333  110.000000
      std         NaN   15.275252   14.142136
      min       100.0   70.000000  100.000000
      25%       100.0   75.000000  105.000000
      50%       100.0   80.000000  110.000000
      75%       100.0   90.000000  115.000000
      max       100.0  100.000000  120.000000

# merge join concat

In [61]:
import pandas as pd

In [64]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [65]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [66]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

**Concatenation**

Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use **pd.concat** and pass in a list of DataFrames to concatenate together:

In [67]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [68]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

_____
**Example DataFrames**

In [70]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [71]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [72]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

___

## Merging

At a basic level, **merge** more or less does the same thing as **join**. It requires specifying the columns as a merge key. We can specify the overlapping columns with parameter on, or can separately specify it with left_on and right_on parameters.

In [73]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

Or to show a more complicated example:

In [74]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [75]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [76]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [78]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [79]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [80]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [81]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

## Joining
The join method takes two dataframes and joins them on their indexes (technically, you can pick the column to join on for the left dataframe). If there are overlapping columns, the join will want you to add a suffix to the overlapping column name from the left dataframe. Our two dataframes do have an overlapping column name P.

In [82]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2'])

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [83]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [84]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# operations

In [85]:
import pandas as pd

In [86]:
data = {'col1': [1,2,3,4], 'col2': ['aaa', 'bbb', 'ccc', 'ddd'], 'col3':[123, 433, 591, 151]}
df = pd.DataFrame(data)
df

   col1 col2  col3
0     1  aaa   123
1     2  bbb   433
2     3  ccc   591
3     4  ddd   151

In [87]:
# quick overview of data frame
df.head()

   col1 col2  col3
0     1  aaa   123
1     2  bbb   433
2     3  ccc   591
3     4  ddd   151

In [88]:
df['col1'].nunique()

4

In [89]:
df['col2'].value_counts()

aaa    1
bbb    1
ccc    1
ddd    1
Name: col2, dtype: int64

In [90]:
# apply function to items
times2 = lambda x: 2*x
df['col3'].apply(times2)

0     246
1     866
2    1182
3     302
Name: col3, dtype: int64

In [91]:
# drop column
df.drop('col1', axis=1)

  col2  col3
0  aaa   123
1  bbb   433
2  ccc   591
3  ddd   151

In [92]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [93]:
df.sort_values('col3')

   col1 col2  col3
0     1  aaa   123
3     4  ddd   151
1     2  bbb   433
2     3  ccc   591

In [94]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [95]:
# pivot method
data = {'A':['aaa', 'aaa', 'aaa', 'bbb', 'bbb', 'bbb'],
        'B':['one', 'one', 'two', 'two', 'one', 'one'],
        'C':['x', 'y', 'x', 'y', 'x', 'y'],
        'D':[1,3,2,5,4,1]}
df = pd.DataFrame(data)
df

     A    B  C  D
0  aaa  one  x  1
1  aaa  one  y  3
2  aaa  two  x  2
3  bbb  two  y  5
4  bbb  one  x  4
5  bbb  one  y  1

In [96]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
aaa one  1.0  3.0
    two  2.0  NaN
bbb one  4.0  1.0
    two  NaN  5.0